# Practice Loading and Exploring Datasets

This assignment is purposely open-ended. You will be asked to load datasets from the [UC-Irvine Machine Learning Repository](https://archive.ics.uci.edu/ml/index.php). 

Even though you maybe using different datasets than your fellow classmates, try and be supportive and assist each other in the challenges that you are facing. You will only deepend your understanding of these topics as you work to assist one another. Many popular UCI datasets face similar data loading challenges.

Remember that the UCI datasets do not necessarily have a file type of `.csv` so it's important that you learn as much as you can about the dataset before you try and load it. See if you can look at the raw text of the file either locally or using the `!curl` shell command -or in some other way before you try and read it in as a dataframe. This will help you catch what would otherwise be unforseen problems.

Feel free to embellish this notebook with additional markdown cells,code cells, comments, graphs, etc. Whatever you think helps adequately address the questions.

## 1) Load a dataset from UCI (via its URL)

Please navigate to the home page and choose a dataset (other than the Adult dataset) from the "Most Popular" section on the right-hand side of the home page. Load the dataset via its URL and check the following (show your work):

- Are the headers showing up properly?
- Look at the first 5 and the last 5 rows, do they seem to be in order?
- Does the dataset have the correct number of rows and columns as described in the UCI page? 
 - Remember, that UCI does not count the y variable (column of values that we might want to predict via a machine learning model) as an "attribute" but rather as a "class attribute" so you may end up seeing a number of columns that is one greater than the number listed on the UCI website.
- Does UCI list this dataset as having missing values? Check for missing values and see if your analysis corroborates what UCI reports?
- if `NaN` values or other missing value indicators are not being detected by `df.isnull().sum()` find a way to replace whatever is indicating the missing values with `np.NaN`.
- Use the .describe() function in order to see the summary statistics of both the numeric and non-numeric columns.

In [1]:
# so the dataset i want to use is in zip format so i have to do some file stuff before i can even get a csv
import zipfile
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# path to my data set .csv
path_local='/content/bank-additional/bank-additional-full.csv'

# use the zipfile module to extract zip
def fetch_unzip():

  # download my .zip with curl because its soo much easier
  # note because im pulling a zip i use the --raw so that i dont impose an encoding
  # encoding to the zip file, i want to get it as it is from the source
  !curl --raw 'https://archive.ics.uci.edu/ml/machine-learning-databases/00222/bank-additional.zip' >'/content/bank_additional.zip'
  zip_ref=zipfile.ZipFile('/content/bank_additional.zip')
  zip_ref.extractall('/content/')
  # make sure i close my zip file
  zip_ref.close()
  return

# alternitive to the above funtion using builtin debian commands
# it saves me from having to close files since the shell is going to handle that
# for me.
def fetch_unzip_alt():
  !curl --raw 'https://archive.ics.uci.edu/ml/machine-learning-databases/00222/bank-additional.zip' >'/content/bank_additional.zip'
  !unzip -Z '/content/bank_additional.zip' -d '/content/'
  return


# a log of R commands from im assuming an R interpreter ..fun
#!cat ./bank-additional/.Rhistory

# call my zip fetching function and print a few lines from the .csv
fetch_unzip()
!head --lines=5 --verbose '/content/bank-additional/bank-additional-full.csv'

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100  434k  100  434k    0     0   275k      0  0:00:01  0:00:01 --:--:--  275k
==> /content/bank-additional/bank-additional-full.csv <==
"age";"job";"marital";"education";"default";"housing";"loan";"contact";"month";"day_of_week";"duration";"campaign";"pdays";"previous";"poutcome";"emp.var.rate";"cons.price.idx";"cons.conf.idx";"euribor3m";"nr.employed";"y"
56;"housemaid";"married";"basic.4y";"no";"no";"no";"telephone";"may";"mon";261;1;999;0;"nonexistent";1.1;93.994;-36.4;4.857;5191;"no"
57;"services";"married";"high.school";"unknown";"no";"no";"telephone";"may";"mon";149;1;999;0;"nonexistent";1.1;93.994;-36.4;4.857;5191;"no"
37;"services";"married";"high.school";"no";"yes";"no";"telephone";"may";"mon";226;1;999;0;"nonexistent";1.1;93.994;-36.4;4.857;5191;"no"
40;"admin.";"married";"basic.6y";"no";"no";"no";"telephone";"may";"mon";151;1;999;0;"nonexistent";1.1;93.994;-36.4;4.857;5191;"no"

In [2]:
# as seen above im going to have to change my delimiter to a simicolon ';' because that is how this
# dataset is organized note that i put an r in front of my string when dealing with specal characters out of habit
# in this instance it dosent do anything because there is no escaping
df=pd.read_csv(path_local,sep=r';')
df.head()

   age        job  marital  ... euribor3m nr.employed   y
0   56  housemaid  married  ...     4.857      5191.0  no
1   57   services  married  ...     4.857      5191.0  no
2   37   services  married  ...     4.857      5191.0  no
3   40     admin.  married  ...     4.857      5191.0  no
4   56   services  married  ...     4.857      5191.0  no

[5 rows x 21 columns]

In [3]:
df.tail()

       age          job  marital  ... euribor3m nr.employed    y
41183   73      retired  married  ...     1.028      4963.6  yes
41184   46  blue-collar  married  ...     1.028      4963.6   no
41185   56      retired  married  ...     1.028      4963.6   no
41186   44   technician  married  ...     1.028      4963.6  yes
41187   74      retired  married  ...     1.028      4963.6   no

[5 rows x 21 columns]

In [4]:
df.dtypes

age                 int64
job                object
marital            object
education          object
default            object
housing            object
loan               object
contact            object
month              object
day_of_week        object
duration            int64
campaign            int64
pdays               int64
previous            int64
poutcome           object
emp.var.rate      float64
cons.price.idx    float64
cons.conf.idx     float64
euribor3m         float64
nr.employed       float64
y                  object
dtype: object

In [5]:
# skip count row it will be in the next cell as shape
df.describe()[1:]

           age     duration   campaign  ...  cons.conf.idx  euribor3m  nr.employed
mean  40.02406   258.285010   2.567593  ...     -40.502600   3.621291  5167.035911
std   10.42125   259.279249   2.770014  ...       4.628198   1.734447    72.251528
min   17.00000     0.000000   1.000000  ...     -50.800000   0.634000  4963.600000
25%   32.00000   102.000000   1.000000  ...     -42.700000   1.344000  5099.100000
50%   38.00000   180.000000   2.000000  ...     -41.800000   4.857000  5191.000000
75%   47.00000   319.000000   3.000000  ...     -36.400000   4.961000  5228.100000
max   98.00000  4918.000000  56.000000  ...     -26.900000   5.045000  5228.100000

[7 rows x 10 columns]

In [6]:
# there are only suposed to be 20 features in this df so im going to remove the
# target column
df_labels=df.pop('y')
print(f"number of rows:{df.shape[0]}\nnumber of columns:{df.shape[1]}")

number of rows:41188
number of columns:20

## 2) Load a dataset from your local machine.
Choose a second dataset from the "Popular Datasets" listing on UCI, but this time download it to your local machine instead of reading it in via the URL. Upload the file to Google Colab using the files tab in the left-hand sidebar or by importing `files` from `google.colab` The following link will be a useful resource if you can't remember the syntax: <https://towardsdatascience.com/3-ways-to-load-csv-files-into-colab-7c14fcbdcb92>

- Answer all of the same bullet point questions from part 1 again on this new dataset.

In [0]:
from google.colab import files
uploaded=files.upload()

In [0]:
# init flagss dataframe
# orriginally started with a diffrent df that had cars in it
#too lazy to rename variable
car_df=pd.read_csv('/content/flag.data')

print(f"\nis na:\n{car_df.isna().sum()}")
print(f"\nis null:\n{car_df.isnull().sum()}")

print(f"\nflag_df.describe:\n{car_df.describe()}")
print(f"\nflags dtypes:\n{car_df.dtypes}")

In [0]:
car_df.head()

## 3) Make Crosstabs of the Categorical Variables

Take whichever of the above datasets has more categorical variables and use crosstabs to tabulate the different instances of the categorical variables.

In [7]:
# a crosstab of job vs education
# i was curious to see if there were any patterns espically in the entrepreneur
# feild
pd.crosstab(df.job,df.education)

# looking at this data im curious to know what distrinction is made between 
# entreprenueur and self-employed i always associate theese two terms togeather

education      basic.4y  basic.6y  ...  university.degree  unknown
job                                ...
admin.               77       151  ...               5753      249
blue-collar        2318      1426  ...                 94      454
entrepreneur        137        71  ...                610       57
housemaid           474        77  ...                139       42
management          100        85  ...               2063      123
retired             597        75  ...                285       98
self-employed        93        25  ...                765       29
services            132       226  ...                173      150
student              26        13  ...                170      167
technician           58        87  ...               1809      212
unemployed          112        34  ...                262       19
unknown              52        22  ...                 45      131

[12 rows x 8 columns]

In [8]:
#did a cross tab using housing as athe index and loan as the cols
# results are to be exspected a larger percent of people who own houses have loans
pd.crosstab(df.housing,df.loan)

loan        no  unknown   yes
housing
no       16065        0  2557
unknown      0      990     0
yes      17885        0  3691

In [11]:
# i dont have any remarks here because im not sure what context the catigorical data has
# @TODO reserch and revise comment
days_months_cross=pd.crosstab(df.month,df.day_of_week)
days_months_cross

day_of_week   fri   mon   thu   tue   wed
month
apr           610   702   768   252   300
aug          1070  1222  1347  1296  1243
dec            24    53    45    25    35
jul          1012  1516  1672  1517  1457
jun          1147  1251   967   970   983
mar            94   143    99   140    70
may          2858  2642  2537  2809  2923
nov           755   766   903   814   863
oct           142   129   163   149   135
sep           115    90   122   118   125

## 4) Explore the distributions of the variables of the dataset using:
- Histograms
- Scatterplots
- Density Plots

In [20]:
# Your Code Here

Index(['apr', 'aug', 'dec', 'jul', 'jun', 'mar', 'may', 'nov', 'oct', 'sep'], dtype='object', name='month')

## 5) Create at least one visualization from a crosstab:

Remember that a crosstab is just a dataframe and can be manipulated in the same way by row index, column, index, or column/row/cell position.

In [0]:
# Your Code Here

## Stretch Goals 

The following additional study tasks are optional, they are intended to give you an opportunity to stretch yourself beyond the main requirements of the assignment. You can pick and choose from the below, you do not need to complete them in any particular order.

### - Practice Exploring other Datasets

### -  Try using the Seaborn plotting library's "Pairplot" functionality in order to explore all of the possible histograms and scatterplots of your dataset all at once:

[Seaborn Pairplot](https://seaborn.pydata.org/generated/seaborn.pairplot.html)

### - Turn some of the continuous variables into categorical variables by binning the values using:
- [pd.cut()](https://pandas.pydata.org/pandas-docs/version/0.23.4/generated/pandas.cut.html)
- [pd.qcut()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.qcut.html)
- <https://stackoverflow.com/questions/30211923/what-is-the-difference-between-pandas-qcut-and-pandas-cut>

And then use crosstabs to compare/visualize these binned variables against the other variables.


### - Other types and sources of data
Not all data comes in a nice single file - for example, image classification involves handling lots of image files. You still will probably want labels for them, so you may have tabular data in addition to the image blobs - and the images may be reduced in resolution and even fit in a regular csv as a bunch of numbers.

If you're interested in natural language processing and analyzing text, that is another example where, while it can be put in a csv, you may end up loading much larger raw data and generating features that can then be thought of in a more standard tabular fashion.

Overall you will in the course of learning data science deal with loading data in a variety of ways. Another common way to get data is from a database - most modern applications are backed by one or more databases, which you can query to get data to analyze. We'll cover this more in our data engineering unit.

How does data get in the database? Most applications generate logs - text files with lots and lots of records of each use of the application. Databases are often populated based on these files, but in some situations you may directly analyze log files. The usual way to do this is with command line (Unix) tools - command lines are intimidating, so don't expect to learn them all at once, but depending on your interests it can be useful to practice.

One last major source of data is APIs: https://github.com/toddmotto/public-apis

API stands for Application Programming Interface, and while originally meant e.g. the way an application interfaced with the GUI or other aspects of an operating system, now it largely refers to online services that let you query and retrieve data. You can essentially think of most of them as "somebody else's database" - you have (usually limited) access.

*Stretch goal* - research one of the above extended forms of data/data loading. See if you can get a basic example working in a notebook. Image, text, or (public) APIs are probably more tractable - databases are interesting, but there aren't many publicly accessible and they require a great deal of setup.